1yib.rust-bundle
2211896472.snippets
aaron-bond.better-comments
adambaker.vsc-prettier-glimmer
alefragnani.numbered-bookmarks
amiralizadeh9480.flutter-widget-wrap
antfu.file-nesting
antfu.goto-alias
antfu.iconify
antfu.smart-clicks
antfu.unocss
antfu.vite
anthropic.claude-code
anysphere.cursorpyright
anysphere.remote-containers
anysphere.remote-ssh
anysphere.remote-wsl
asvetliakov.vscode-neovim
bbenoist.doxygen
bbenoist.nix
bbugh.change-color-format
biati.vscode-show-hide-excluded-files
bierner.color-info
bierner.lit-html
bradlc.vscode-tailwindcss
chaitanyashahare.lazygit
charliermarsh.ruff
chrisbibby.hide-git-ignored
chrisbibby.hide-node-modules
circlecodesolution.ccs-flutter-color
coder.coder-remote
cschlosser.doxdocgen
csstools.postcss
dan-c-underwood.arm
dariofuzinato.vue-peek
dart-code.dart-code
dart-code.flutter
dbaeumer.vscode-eslint
docker.docker
donjayamanne.githistory
dustypomerleau.rust-syntax
eamodio.gitlens
ecmel.vscode-html-css
editorconfig.editorconfig
esbenp.prettier-vscode
exodiusstudios.comment-anchors
expo.vscode-expo-tools
file-icons.file-icons
fill-labs.dependi
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
fredwangwang.vscode-hcl-format
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
gkarlos.vscode-ptx-syntax
golang.go
google.gemini-cli-vscode-ide-companion
grapecity.gc-excelviewer
hashicorp.hcl
hashicorp.terraform
hbenl.vscode-test-explorer
hiyajo.cppcomment
jacobdufault.fuzzy-search
james-yu.latex-workshop
janisdd.vscode-edit-csv
jannchie.ruff-ignore-explainer
jeff-hykin.better-cpp-syntax
jnoortheen.nix-ide
jock.svg
johnpapa.vscode-peacock
julialang.language-julia
k--kato.intellij-idea-keybindings
kahole.magit
kamadorueda.alejandra
leanprover.lean4
lextudio.restructuredtext
llvm-vs-code-extensions.vscode-clangd
lmcarreiro.vscode-smart-column-indenter
lokalise.i18n-ally
madhavd1.javadoc-tools
mathematic.vscode-pdf
meta.pyrefly
mindaro-dev.file-downloader
modular-mojotools.vscode-mojo
monokai.theme-monokai-pro-vscode
mquandalle.graphql
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.isort
ms-python.mypy-type-checker
ms-python.pylint
ms-python.python
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh-edit
ms-vscode.atom-keybindings
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vscode.test-adapter-converter
ms-vscode.vscode-typescript-next
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-pack
msjsdiag.vscode-react-native
naumovs.color-highlight
oderwat.indent-rainbow
perkovec.emoji
pkief.material-icon-theme
polymeilex.wgsl
quicktype.quicktype
rebornix.toggle
redhat.java
redhat.vscode-commons
redhat.vscode-xml
redhat.vscode-yaml
reditorsupport.r-syntax
roonie007.hide-files
ruoz.coq
rust-lang.rust-analyzer
ryanolsonx.solarized
scala-lang.scala
scalameta.metals
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-french
sumneko.lua
swellaby.vscode-rust-test-adapter
tamasfe.even-better-toml
tauri-apps.tauri-vscode
timonwong.shellcheck
trond-snekvik.simple-rst
twxs.cmake
unifiedjs.vscode-mdx
usernamehw.errorlens
vadimcn.vscode-lldb
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
voorjaar.windicss-intellisense
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vue.volar
wgsl-analyzer.wgsl-analyzer
wraith13.zoombar-vscode
wscourge.togglecase
xadillax.viml
yoavbls.pretty-ts-errors
yzhang.markdown-all-in-one
zignd.html-css-class-completion
zixuanwang.linkerscript
